In [35]:
import pandas as pd

In [36]:
df = pd.read_csv('so-df/survey_results_public.csv')
# df
# df.head()
df.tail()

,ResponseId,MainBranch,Age,Employment,RemoteWork,Check,CodingActivities,EdLevel,LearnCode,LearnCodeOnline,...,JobSatPoints_6,JobSatPoints_7,JobSatPoints_8,JobSatPoints_9,JobSatPoints_10,JobSatPoints_11,SurveyLength,SurveyEase,ConvertedCompYearly,JobSat
65432,65433,I am a developer by profession,18-24 years old,"Employed, full-time",Remote,Apples,Hobby;School or academic work,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","On the job training;School (i.e., University, ...",NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65433,65434,I am a developer by profession,25-34 years old,"Employed, full-time",Remote,Apples,Hobby;Contribute to open-source projects,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65434,65435,I am a developer by profession,25-34 years old,"Employed, full-time",In-person,Apples,Hobby,"Bachelor’s degree (B.A., B.S., B.Eng., etc.)","Other online resources (e.g., videos, blogs, f...",Technical documentation;Stack Overflow;Social ...,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
65435,65436,I am a developer by profession,18-24 years old,"Employed, full-time","Hybrid (some remote, some in-person)",Apples,Hobby;Contribute to open-source projects;Profe...,"Secondary school (e.g. American high school, G...",On the job training;Other online resources (e....,Technical documentation;Blogs;Written Tutorial...,...,0.0,0.0,0.0,0.0,0.0,0.0,NaN,NaN,NaN,NaN
65436,65437,I code primarily as a hobby,18-24 years old,"Student, full-time",NaN,Apples,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [37]:
df.shape # attribute

(65437, 114)

In [38]:
df.info() # method

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65437 entries, 0 to 65436
Columns: 114 entries, ResponseId to JobSat
dtypes: float64(13), int64(1), object(100)
memory usage: 56.9+ MB

In [5]:
pd.set_option('display.max_columns', 114)

In [4]:
people = {
    "first": ["Anurag", "John"],
    "last": ["Verma", "Doe"],
    "email": ["test@gmail.com", "Johndoe@gmail.com"]
}

# people = [
#     {
#         "name": "Anurag",
#         "email": "test@gmail.com",
#         "city": "Jaipur"
#     },
#     {
#         "name": "Harmeet",
#         "email": "test@gmail.com",
#         "city": "Punjab"
#     },
# ]

In [5]:
people["email"]

['test@gmail.com', 'Johndoe@gmail.com']

In [14]:
df = pd.DataFrame(people)
df

    first   last              email
0  Anurag  Verma     test@gmail.com
1    John    Doe  Johndoe@gmail.com

In [47]:
df.email

0       test@gmail.com
1    Johndoe@gmail.com
Name: email, dtype: object

In [39]:
df.columns

Index(['ResponseId', 'MainBranch', 'Age', 'Employment', 'RemoteWork', 'Check',
       'CodingActivities', 'EdLevel', 'LearnCode', 'LearnCodeOnline',
       ...
       'JobSatPoints_6', 'JobSatPoints_7', 'JobSatPoints_8', 'JobSatPoints_9',
       'JobSatPoints_10', 'JobSatPoints_11', 'SurveyLength', 'SurveyEase',
       'ConvertedCompYearly', 'JobSat'],
      dtype='object', length=114)

In [ ]:
# df.iloc[0]  # loc
df.iloc[[0, 1], 2]  # df.iloc[[row], column]

    first   last              email
0  Anurag  Verma     test@gmail.com
1    John    Doe  Johndoe@gmail.com

In [59]:
df.loc[[0,1], ['email', 'first']]  # df.loc[[row], 'column']

               email   first
0     test@gmail.com  Anurag
1  Johndoe@gmail.com    John

In [64]:
df.loc[0:1, 'email']  # df.loc[row_start:row_end, col_start:col_end]
df.loc[0:1, 'first':'email']

    first   last              email
0  Anurag  Verma     test@gmail.com
1    John    Doe  Johndoe@gmail.com

In [ ]:
df.set_index('email') # inplace=False by default

                    first   last
email
test@gmail.com     Anurag  Verma
Johndoe@gmail.com    John    Doe

In [8]:
df.index

RangeIndex(start=0, stop=65437, step=1)

In [16]:
df.reset_index(inplace=True)

In [28]:
# fil = (df['last'] == 'Doe') & (df['first'] == 'John')
fil = (df['last'] == 'Doe') | (df['first'] == 'Anurag')

In [29]:
df[fil]

   index   first   last              email
0      0  Anurag  Verma     test@gmail.com
1      1    John    Doe  Johndoe@gmail.com

In [ ]:
# df.loc[fil, 'email']
df.loc[~fil, 'email']

Series([], Name: email, dtype: object)

In [43]:
high_response = (df['ResponseId'] > 60000)
high_response

0        False
1        False
2        False
3        False
4        False
         ...
65432     True
65433     True
65434     True
65435     True
65436     True
Name: ResponseId, Length: 65437, dtype: bool

In [44]:
df.loc[high_response, ['Country']]

                        Country
60000                       NaN
60001  United States of America
60002                       NaN
60003                       NaN
60004  United States of America
...                         ...
65432                       NaN
65433                       NaN
65434                       NaN
65435                   Germany
65436                       NaN

[5437 rows x 1 columns]

In [54]:
countries = ['India', 'United States', 'Canada', 'Germany']

filt = df['Country'].isin(countries)
df.loc[filt, 'Country']

# filt = df['LanguageWorkedWith'].str.contains('Python', na=False)
# df.loc[filt, 'LanguageWorkedWith']

3         Canada
16        Canada
17         India
18       Germany
20       Germany
          ...
65383      India
65413      India
65415      India
65428      India
65435    Germany
Name: Country, Length: 11282, dtype: object